//ტემპერატურის ფიდბექის პროგრამა:
//დაწერეთ კონსოლური აპლიკაცია, რომელიც მომხმარებლისაგან მიიღებს ტემპერატურას ცელსიუსებში. თუ ტემპერატურა
//ნაკლებია 0 ზე მაშინ აპლიკაციამ უნდა კონსოლზე გამოიტანოს რომ "ყინავს", თუ ტემპერატურა 0 სა და 30 ს შორისაა
//აპლიკაციამ კონსოლზე უნდა გამოიტანოს "კარგი ამინდია", ხოლო თუ ტემპერატურა 30ს ზემოთაა მაშინ უნდა დაწეროს რომ
//"ცხელა". მომხმარებლის ინფუთი მიიღეთ ტექსტურად და გადაიყვანეთ int ში.


Console.WriteLine("temperature in Celsius:");
string inp = Console.ReadLine();
int temp = Convert.ToInt32(inp);
if (temp < 0)
{
    Console.WriteLine("yinavs");
}
else if (temp >= 0 && temp <= 30)
{
    Console.WriteLine("kargi amindia");
}
else
{
    Console.WriteLine("tskhela");
}