//შესაქმნელია კონსოლური აპლიკაცია რომელსაც გადაეცემა ერთგანზომილებიანი მასივის ზომა N,
//და მასვის ელემენტები, ნატურალური რიცხვები. მასივის ყველა ელემენტის შეყვანის შემდეგ კონსოლში უნდა დაიბეჭდოს
//ზრდადობით დალაგებული მასივის ელემენტები. დალაგების ალგორითმის რეალიზაცია უნდა მოახდინოთ თავად და არა
//მზა საშუალებების გამოყენებით. სორტირების ალგორითმი რეალიზებული უნდა იყოს შემდეგი პრინციპით -
//მასივის ყოველი ელემენტი უნდა შედარდეს მომდევნო ელემენტთან, და თუ ელემენტი მეტია მომდევნოზე ელემენტები
//უნდა გადაანაცვლონ მდებარეობა. შედარება და გადანაცვლება უნდა განმეორდეს მანამ სანამ მასივი არ დალაგდება სრულად.
Console.WriteLine("masivis zoma:");
int size = int.Parse(Console.ReadLine());
int[] numb = new int[size];
for (int i = 0; i < size; i++)
{
    Console.WriteLine($"masivis elementi[{i}]");
    int element = int.Parse(Console.ReadLine());
    numb[i] = element;
}
for (int i = 0; i < size; i++)
{
    for (int j = 0; j < size-i-1; j++)
    {
    if (numb[j] > numb[j+1])
      {
         int val = numb[j];
         numb[j] = numb[j+1];
         numb[j+1] = val;
      }
    }
}
foreach (int elements in numb)
{
    Console.Write(elements + " ");
}